; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=30, remove_proportion=0.2, bases=6, instance_id=16, output=./training, seed=57

(define (problem warehouse-16)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 - box
        base1 base2 base3 base4 base5 base6 - base
    )
    (:init
        (to-remove box1)
        (to-remove box2)
        (to-remove box8)
        (to-remove box12)
        (to-remove box19)
        (to-remove box20)
        (clear box16)
        (on box16 box8)
        (on-base box8 base1)
        (clear box26)
        (on box26 box10)
        (on box10 box28)
        (on box28 box29)
        (on-base box29 base2)
        (clear box13)
        (on box13 box2)
        (on box2 box4)
        (on box4 box23)
        (on-base box23 base3)
        (clear box3)
        (on box3 box21)
        (on box21 box15)
        (on box15 box30)
        (on box30 box14)
        (on box14 box7)
        (on box7 box5)
        (on-base box5 base4)
        (clear box12)
        (on box12 box11)
        (on box11 box27)
        (on box27 box22)
        (on box22 box19)
        (on box19 box25)
        (on box25 box1)
        (on-base box1 base5)
        (clear box18)
        (on box18 box24)
        (on box24 box9)
        (on box9 box17)
        (on box17 box20)
        (on box20 box6)
        (on-base box6 base6)
    )
    (:goal (and 
        (removed box1)
        (removed box2)
        (removed box8)
        (removed box12)
        (removed box19)
        (removed box20)
    ))
)

; plan
1. (move box13 box2 box26)
   deleted: (clear box26) (on box13 box2)
   added: (on box13 box26) (clear box2)
   goals met: 0 of 6
2. (remove box12 box11)
   deleted: (on box12 box11) (clear box12)
   added: (removed box12) (clear box11)
   goals met: 1 of 6
3. (move box11 box27 box13)
   deleted: (clear box13) (on box11 box27)
   added: (on box11 box13) (clear box27)
   goals met: 1 of 6
4. (move box16 box8 box11)
   deleted: (clear box11) (on box16 box8)
   added: (on box16 box11) (clear box8)
   goals met: 1 of 6
5. (move box18 box24 box16)
   deleted: (clear box16) (on box18 box24)
   added: (on box18 box16) (clear box24)
   goals met: 1 of 6
6. (move box24 box9 box18)
   deleted: (clear box18) (on box24 box9)
   added: (on box24 box18) (clear box9)
   goals met: 1 of 6
7. (remove box2 box4)
   deleted: (on box2 box4) (clear box2)
   added: (removed box2) (clear box4)
   goals met: 2 of 6
8. (move box27 box22 box24)
   deleted: (clear box24) (on box27 box22)
   added: (on box27 box24) (clear box22)
   goals met: 2 of 6
9. (move box22 box19 box27)
   deleted: (clear box27) (on box22 box19)
   added: (on box22 box27) (clear box19)
   goals met: 2 of 6
10. (remove box19 box25)
   deleted: (on box19 box25) (clear box19)
   added: (removed box19) (clear box25)
   goals met: 3 of 6
11. (move box25 box1 box22)
   deleted: (clear box22) (on box25 box1)
   added: (on box25 box22) (clear box1)
   goals met: 3 of 6
12. (remove-from-base box1 base5)
   deleted: (on-base box1 base5) (clear box1)
   added: (removed box1) (clear-base base5)
   goals met: 4 of 6
13. (move box9 box17 box25)
   deleted: (clear box25) (on box9 box17)
   added: (on box9 box25) (clear box17)
   goals met: 4 of 6
14. (move box17 box20 box3)
   deleted: (clear box3) (on box17 box20)
   added: (on box17 box3) (clear box20)
   goals met: 4 of 6
15. (remove box20 box6)
   deleted: (on box20 box6) (clear box20)
   added: (removed box20) (clear box6)
   goals met: 5 of 6
16. (remove-from-base box8 base1)
   deleted: (on-base box8 base1) (clear box8)
   added: (removed box8) (clear-base base1)
   goals met: 6 of 6
